<?php
/*
 * этот файл перезаписывается при обновлениях
 * используйте его в качестве примера
 */

$settings = [
    'title' => 'Редактор с колонками',
    //Пример пользовательских настроек для сеток
    'layout_settings' => [
      'type1' => [],
      'type2' => [],
      'type3' => [],
      'type4' => [],
    ],
    //Доступные классы колонок для сеток
      'layout_classes'  => [
         'type1' => [
            ['col-3','col-4', 'col-6', 'col-8','col-9','col-12'],
         ],
         'type2' => [
            ['col-3','col-4', 'col-6', 'col-8','col-9', 'col-12'],
         ],
         'type3' => [
            ['col-4'],
         ],
      ],

    //Классы колонок для сеток по умолчанию
    'layout_defaults' => [
      'type1' => '',
      'type2' => 'col-6',
      'type3' => 'col-4',
    ],

    //Названия классов для колонок
   'layout_titles'   => [
      'col-3' => "25%",
      'col-4' => "33%",
      'col-6' => "50%",
      'col-8' => "66%",
      'col-9' => "75%",
      'col-12' => "100%"
   ],
   'layout_enabled'  => [
              'layout_1',
              'layout_2',
              'layout_3',
              'layout_4',
  ],
];
